TGV_SAT/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    upperBoundary
    {
        type             cyclic;
    }
    lowerBoundary
    {
        type             cyclic;
    }
    leftBoundary
    {
        type             cyclic;
    }
    rightBoundary
    {
        type             cyclic;
    }
    frontAndBack
    {
        type             empty;
    }
}

// ************************************************************************* //
