TGV_SAT/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    upperBoundary
    {
        type             cyclic;
    }
    lowerBoundary
    {
        type             cyclic;
    }
    leftBoundary
    {
        type             cyclic;
    }
    rightBoundary
    {
        type             cyclic;
    }
    frontAndBack
    {
        type             empty;
    }
}



// ************************************************************************* //
