TGV_SAT/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;    //Dummy as it uses the AlguFVM solver

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         600.0;

deltaT          0.005;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;


// ************************************************************************* //
