TGV_SAT/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;    //Dummy, since only pcg is implemented
        tolerance       1e-06;
    }
}

AlguFVM
{
    scheme          stdRK4;
    interpolation   volumetric;
    LapStencil      compact;
    PWIM            true;
    pnPredCoef      0;
    pRefPoint       (3.1415 3.1415 0);
    pRefValue       0.5;
    // SAT parameters
    computeEV       true;
    enableSAT       true;
    plotSATStats    true;
    fdT             0.65;
    showRegion      true;
    sampleFreq      300;
    perturbate      true;
    evalPercent     0.2;
}

// ************************************************************************* //
